Dlubal.TimberPro.CrossSectionStatus
Status of the cross-section.

Dlubal.TimberPro.CrossSectionStatus.UnknownStatus
Unknown status

Dlubal.TimberPro.CrossSectionStatus.NoStatus
No extra status

Dlubal.TimberPro.CrossSectionStatus.DifferentCrossSection
The cross-section in the application is different from that in the module.

Dlubal.TimberPro.CrossSectionStatus.GeneralType
Type General - Only Class 3 is possible.

Dlubal.TimberPro.CrossSectionStatus.IncorrectMaterial
Incorrect material of cross-section.

Dlubal.TimberPro.CrossSectionStatus.IncorrectCrossSectionAssigned
Incorrect cross-section data.

Dlubal.TimberPro.CrossSectionStatus.NoMaterialWeight
The weight of the material of this cross-section is zero.

Dlubal.TimberPro.CrossSectionStatus.IncorrectCrossSectionType
Incorrect type of cross-section.

Dlubal.TimberPro.CrossSectionStatus.NotUsedInApplication
The cross-section is not assigned to any member.

Dlubal.TimberPro.CrossSectionStatus.NotUsedInModule
No member with this cross-section is selected for design.

Dlubal.TimberPro.CrossSectionStatus.WillBeOptimized
The cross-section will be optimized. Therefore, the optimal section from the table will be used.